src/test/resources/criarPedido.xml

<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:ser="http://services.senior.com.br">
    <soapenv:Body>
        <ser:SERVICE>
            <user>USER</user>
            <password>PSWD</password>
            <encryption>ENCRYPTION</encryption>
            <parameters>
                <converterQtdUnidadeVenda>N</converterQtdUnidadeVenda>
                <ignorarErrosParcela>N</ignorarErrosParcela>
                <inserirApenasPedidoCompleto>S</inserirApenasPedidoCompleto>
                <pedido>
                    <tnsPro>12345</tnsPro>
                    <codEmp>1</codEmp>
                    <codFil>1</codFil>
                    <indPre>1</indPre>
                    <opeExe>I</opeExe>
                    <temPar>N</temPar>
                    <codCli>1</codCli>
                    <produto>
                        <tnsPro>12345</tnsPro>
                        <codDer>01</codDer>
                        <codTpr>TPL</codTpr>
                        <qtdPed>1</qtdPed>
                        <resEst>S</resEst>
                        <codDep>1000</codDep>
                        <opeExe>I</opeExe>
                        <codPro>0202</codPro>
                        <perAcr>0,0</perAcr>
                        <perDsc>0,0</perDsc>
                        <obsIpd></obsIpd>
                        <pedPrv>N</pedPrv>
                        <vlrDsc>0,0</vlrDsc>
                    </produto>
                    <produto>
                        <tnsPro>12345</tnsPro>
                        <codDer>02</codDer>
                        <codTpr>TPL</codTpr>
                        <qtdPed>1</qtdPed>
                        <resEst>S</resEst>
                        <codDep>1000</codDep>
                        <opeExe>I</opeExe>
                        <codPro>0202</codPro>
                        <perAcr>0,0</perAcr>
                        <perDsc>0,0</perDsc>
                        <obsIpd></obsIpd>
                        <pedPrv>N</pedPrv>
                        <vlrDsc>0,0</vlrDsc>
                    </produto>
                    <acePar>N</acePar>
                    <codCpg>001D</codCpg>
                    <usuario>
                        <cmpUsu>USU_VLRTRO</cmpUsu>
                        <vlrUsu>0</vlrUsu>
                    </usuario>
                    <vlrDar>0</vlrDar>
                    <codRep>35</codRep>
                    <cifFob>X</cifFob>
                </pedido>
                <converterQtdUnidadeEstoque>N</converterQtdUnidadeEstoque>
                <ignorarPedidoBloqueado>N</ignorarPedidoBloqueado>
                <ignorarErrosPedidos>N</ignorarErrosPedidos>
                <ignorarErrosItens>N</ignorarErrosItens>
            </parameters>
        </ser:SERVICE>
    </soapenv:Body>
</soapenv:Envelope>